SemiDNVSESAM/background/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.1505e-6;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            epsilonWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform	8.1505e-6;
    }

    walls
    {
        type            slip;
    }

    atmosphere
    {
        type            inletOutlet;
	inletValue	uniform	8.1505e-6;
	value		uniform	8.1505e-6;
    }

    floatingObject
    {
        type            epsilonWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform	8.1505e-6;
    }

    overset
    {
        type            overset;
    }

    sides
    {
        type            overset;
    }
}

// ************************************************************************* //
