SemiDNVSESAM/background/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            calculated;
	value		uniform  0;
    }

    outlet
    {
        type            calculated;
	value		uniform  0;
    }

    ground
    {
        type            nutkWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform	0;
    }

    walls
    {
        type            slip;
    }

    atmosphere
    {
        type            calculated;
	value		uniform	0;
    }

    floatingObject
    {
        type            nutkWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform	0;
    }

    overset
    {
        type            overset;
    }

    sides
    {
        type            overset;
    }
}

// ************************************************************************* //
