SemiDNVSESAM/background/Allrun.continue
#!/bin/sh

mpirun -np 20 overWaveFoam -parallel | tee IHFCaseContinue.foam
reconstructPar


#------------------------------------------------------------------------------
