SemiDNVSESAM/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (floatingObject);
    innerDistance   5.0;
    outerDistance   10.0;

    centreOfMass    (0.0 0.0 -3.8785);





    beta            0.25;
    gamma           0.5;
    waterDensity    1000;

    // Cuboid mass
    mass            21267000;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (18675000000.0 16629300000.0 26103900000.0);

    report          on;
    accelerationRelaxation 0.6;

    solver
    {
        type Newmark;
    }

    constraints
    {





    }
}

// ************************************************************************* //
