SemiDNVSESAM/background/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.0;


// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName outlet;

inletCoeffs
{
    // Wave type to be used at boundary "inlet" and in relaxation zone "inlet"
    waveType    stokesSecond;  
    
    // Ramp time of 2 s
    Tsoft       2;

    // Water depth at the boundary and in the relaxation zone
    depth       450.000000;

    // Phase shift in the wave
    phi         0.000000;

    // Wave number vector, k. 
    direction  (1.0 0.0 0.0);

    // Wave height
    height      10.0;

    omega       0.7392;
    debug       false;

    waveNumber (0.0445 0.0 0.0);
    
    // Specifications on the relaxation zone shape and relaxation scheme
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (-340.0 -250.0 0.0 );
        endX        (-200.0 250.0 0.0 );
        orientation      (1.0 0.0 0.0);
    }
};

outletCoeffs
{
    waveType    potentialCurrent;
    U           (0 0 0);
    Tsoft       2;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (140.00 -250.0 0.0 );
        endX        (360.00 250.0 0.0 );
        orientation      (1.0 0.0 0.0);
    }
};



// ************************************************************************* //
