SemiDNVSESAM/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-340.0 -250.0 -450.0)
    (360.0 -250.0 -450.0)
    (360.0 250.0 -450.0)
    (-340.0 250.0 -450.0)
    (-340.0 -250.0 150.0)
    (360.0 -250.0 150.0)
    (360.0 250.0 150.0)
    (-340.0 250.0 150.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 50 75) 
    simpleGrading 
        (
           1
           1
           (
             (0.74166666 0.74166666 0.2)
             (0.01666666 0.01666666 1)
             (0.24166666 0.24166666 5)
           )
        )
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other
    // bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }


    walls
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
